vabt-igd/Adafruit_nRF52_Arduino/boards.txt
# Debug Menu
xiaonRF52840.menu.debug.l0=Level 0 (Release)
xiaonRF52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
xiaonRF52840.menu.debug.l1=Level 1 (Error Message)
xiaonRF52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
xiaonRF52840.menu.debug.l2=Level 2 (Full Debug)
xiaonRF52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
xiaonRF52840.menu.debug.l3=Level 3 (Segger SystemView)
xiaonRF52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
xiaonRF52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# Seeed XIAO nRF52840 Sense
# ----------------------------------

xiaonRF52840Sense.name=Seeed XIAO nRF52840 Sense

# VID/PID for bootloader
xiaonRF52840Sense.vid.0=0x2886
xiaonRF52840Sense.pid.0=0x8045
xiaonRF52840Sense.vid.1=0x2886
xiaonRF52840Sense.pid.1=0x0045
xiaonRF52840Sense.vid.2=0x2886
xiaonRF52840Sense.pid.2=0x0045
xiaonRF52840Sense.vid.3=0x2886
xiaonRF52840Sense.pid.3=0x8045

# Upload
xiaonRF52840Sense.bootloader.tool=bootburn
xiaonRF52840Sense.upload.tool=nrfutil
xiaonRF52840Sense.upload.protocol=nrfutil
xiaonRF52840Sense.upload.use_1200bps_touch=true
xiaonRF52840Sense.upload.wait_for_upload_port=true
xiaonRF52840Sense.upload.maximum_size=811008
xiaonRF52840Sense.upload.maximum_data_size=237568

# Build
xiaonRF52840Sense.build.mcu=cortex-m4
xiaonRF52840Sense.build.f_cpu=64000000
xiaonRF52840Sense.build.board=Seeed_XIAO_nRF52840_Sense
xiaonRF52840Sense.build.core=nRF5
xiaonRF52840Sense.build.variant=Seeed_XIAO_nRF52840_Sense
xiaonRF52840Sense.build.usb_manufacturer="Seeed"
xiaonRF52840Sense.build.usb_product="XIAO nRF52840 Sense"
xiaonRF52840Sense.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
xiaonRF52840Sense.build.ldscript=nrf52840_s140_v7.ld
xiaonRF52840Sense.build.vid=0x2886
xiaonRF52840Sense.build.pid=0x8045

# SofDevice Menu
xiaonRF52840Sense.menu.softdevice.s140v6=S140 7.3.0
xiaonRF52840Sense.menu.softdevice.s140v6.build.sd_name=s140
xiaonRF52840Sense.menu.softdevice.s140v6.build.sd_version=7.3.0
xiaonRF52840Sense.menu.softdevice.s140v6.build.sd_fwid=0x0123

# Debug Menu
xiaonRF52840Sense.menu.debug.l0=Level 0 (Release)
xiaonRF52840Sense.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
xiaonRF52840Sense.menu.debug.l1=Level 1 (Error Message)
xiaonRF52840Sense.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
xiaonRF52840Sense.menu.debug.l2=Level 2 (Full Debug)
xiaonRF52840Sense.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
xiaonRF52840Sense.menu.debug.l3=Level 3 (Segger SystemView)
xiaonRF52840Sense.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
xiaonRF52840Sense.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# -----------------------------------
# Adafruit Feather nRF52840
# -----------------------------------

feather52840.build.mcu=cortex-m4
feather52840.build.f_cpu=64000000
feather52840.build.board=NRF52840_FEATHER
feather52840.build.core=nRF5
feather52840.build.variant=feather_nrf52840_express
feather52840.build.usb_manufacturer="Adafruit"
feather52840.build.usb_product="Feather nRF52840 Express"
feather52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
feather52840.build.ldscript=nrf52840_s140_v6.ld
feather52840.build.openocdscript=scripts/openocd/daplink_nrf52.cfg
feather52840.build.vid=0x239A
feather52840.build.pid=0x8029
feather52840.build.uf2_family=0xADA52840

# Menu: SoftDevice
feather52840.menu.softdevice.s140v6=S140 6.1.1
feather52840.menu.softdevice.s140v6.build.sd_name=s140
feather52840.menu.softdevice.s140v6.build.sd_version=6.1.1
feather52840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Menu: Debug Level
feather52840.menu.debug.l0=Level 0 (Release)
feather52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
feather52840.menu.debug.l1=Level 1 (Error Message)
feather52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
feather52840.menu.debug.l2=Level 2 (Full Debug)
feather52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
feather52840.menu.debug.l3=Level 3 (Segger SystemView)
feather52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
feather52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Menu: Debug Port
feather52840.menu.debug_output.serial=Serial
feather52840.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
feather52840.menu.debug_output.serial1=Serial1
feather52840.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
feather52840.menu.debug_output.rtt=Segger RTT
feather52840.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL

# -----------------------------------
# Adafruit Feather nRF52840 Sense
# -----------------------------------

feather52840sense.build.mcu=cortex-m4
feather52840sense.build.f_cpu=64000000
feather52840sense.build.board=NRF52840_FEATHER_SENSE
feather52840sense.build.core=nRF5
feather52840sense.build.variant=feather_nrf52840_sense
feather52840sense.build.usb_manufacturer="Adafruit"
feather52840sense.build.usb_product="Feather nRF52840 Sense"
feather52840sense.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
feather52840sense.build.ldscript=nrf52840_s140_v6.ld
feather52840sense.build.openocdscript=scripts/openocd/daplink_nrf52.cfg
feather52840sense.build.vid=0x239A
feather52840sense.build.pid=0x8087
feather52840sense.build.uf2_family=0xADA52840

# Menu: SoftDevice
feather52840sense.menu.softdevice.s140v6=S140 6.1.1
feather52840sense.menu.softdevice.s140v6.build.sd_name=s140
feather52840sense.menu.softdevice.s140v6.build.sd_version=6.1.1
feather52840sense.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Menu: Debug Level
feather52840sense.menu.debug.l0=Level 0 (Release)
feather52840sense.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
feather52840sense.menu.debug.l1=Level 1 (Error Message)
feather52840sense.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
feather52840sense.menu.debug.l2=Level 2 (Full Debug)
feather52840sense.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
feather52840sense.menu.debug.l3=Level 3 (Segger SystemView)
feather52840sense.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
feather52840sense.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Menu: Debug Port
feather52840sense.menu.debug_output.serial=Serial
feather52840sense.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
feather52840sense.menu.debug_output.serial1=Serial1
feather52840sense.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
feather52840sense.menu.debug_output.rtt=Segger RTT
feather52840sense.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL

# -----------------------------------
# Adafruit Feather nRF52840 Sense TFT
# -----------------------------------

feather_nrf52840_sense_tft.name=Adafruit Feather nRF52840 Sense TFT

# VID/PID for Bootloader, Arduino & CircuitPython
feather_nrf52840_sense_tft.vid.0=0x239A
feather_nrf52840_sense_tft.pid.0=0x8087
feather_nrf52840_sense_tft.vid.1=0x239A
feather_nrf52840_sense_tft.pid.1=0x0087
feather_nrf52840_sense_tft.vid.2=0x239A
feather_nrf52840_sense_tft.pid.2=0x0088
feather_nrf52840_sense_tft.vid.3=0x239A
feather_nrf52840_sense_tft.pid.3=0x8088

# Upload
feather_nrf52840_sense_tft.bootloader.tool=bootburn
feather_nrf52840_sense_tft.upload.tool=nrfutil
feather_nrf52840_sense_tft.upload.protocol=nrfutil
feather_nrf52840_sense_tft.upload.use_1200bps_touch=true
feather_nrf52840_sense_tft.upload.wait_for_upload_port=true
feather_nrf52840_sense_tft.upload.maximum_size=815104
feather_nrf52840_sense_tft.upload.maximum_data_size=237568

# Build
feather_nrf52840_sense_tft.build.mcu=cortex-m4
feather_nrf52840_sense_tft.build.f_cpu=64000000
feather_nrf52840_sense_tft.build.board=NRF52840_FEATHER_SENSE_TFT
feather_nrf52840_sense_tft.build.core=nRF5
feather_nrf52840_sense_tft.build.variant=feather_nrf52840_sense_tft
feather_nrf52840_sense_tft.build.usb_manufacturer="Adafruit"
feather_nrf52840_sense_tft.build.usb_product="Feather nRF52840 Sense TFT"
feather_nrf52840_sense_tft.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
feather_nrf52840_sense_tft.build.ldscript=nrf52840_s140_v6.ld
feather_nrf52840_sense_tft.build.openocdscript=scripts/openocd/daplink_nrf52.cfg
feather_nrf52840_sense_tft.build.vid=0x239A
feather_nrf52840_sense_tft.build.pid=0x8087
feather_nrf52840_sense_tft.build.uf2_family=0xADA52840

# Menu: SoftDevice
feather_nrf52840_sense_tft.menu.softdevice.s140v6=S140 6.1.1
feather_nrf52840_sense_tft.menu.softdevice.s140v6.build.sd_name=s140
feather_nrf52840_sense_tft.menu.softdevice.s140v6.build.sd_version=6.1.1
feather_nrf52840_sense_tft.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Menu: Debug Level
feather_nrf52840_sense_tft.menu.debug.l0=Level 0 (Release)
feather_nrf52840_sense_tft.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
feather_nrf52840_sense_tft.menu.debug.l1=Level 1 (Error Message)
feather_nrf52840_sense_tft.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
feather_nrf52840_sense_tft.menu.debug.l2=Level 2 (Full Debug)
feather_nrf52840_sense_tft.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
feather_nrf52840_sense_tft.menu.debug.l3=Level 3 (Segger SystemView)
feather_nrf52840_sense_tft.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
feather_nrf52840_sense_tft.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Menu: Debug Port
feather_nrf52840_sense_tft.menu.debug_output.serial=Serial
feather_nrf52840_sense_tft.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
feather_nrf52840_sense_tft.menu.debug_output.serial1=Serial1
feather_nrf52840_sense_tft.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
feather_nrf52840_sense_tft.menu.debug_output.rtt=Segger RTT
feather_nrf52840_sense_tft.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL

# -----------------------------------
# Seeed Wio Tracker 1110
# -----------------------------------

wio_tracker_1110.name=Seeed Wio Tracker 1110

# Upload
wio_tracker_1110.bootloader.tool=bootburn
wio_tracker_1110.upload.tool=nrfutil
wio_tracker_1110.upload.protocol=nrfutil
wio_tracker_1110.upload.use_1200bps_touch=true
wio_tracker_1110.upload.wait_for_upload_port=true
wio_tracker_1110.upload_port.0.vid=0x2886
wio_tracker_1110.upload_port.0.pid=0x8055
wio_tracker_1110.upload_port.1.vid=0x2886
wio_tracker_1110.upload_port.1.pid=0x0055

