vabt-igd/Adafruit_nRF52_Arduino/boards.txt
## Flash 0x000e_8000 - 0x0002_6000
wio_tracker_1110.upload.maximum_size=794624

## RAM   0x2004_0000 - 0x2000_6000
wio_tracker_1110.upload.maximum_data_size=237568

# Build
wio_tracker_1110.build.mcu=cortex-m4
wio_tracker_1110.build.f_cpu=64000000
wio_tracker_1110.build.board=WIO_TRACKER_1110
wio_tracker_1110.build.core=nRF5
wio_tracker_1110.build.variant=Seeed_Wio_Tracker_1110
wio_tracker_1110.build.usb_manufacturer="Seeed"
wio_tracker_1110.build.usb_product="Wio Tracker 1110"
wio_tracker_1110.build.extra_flags=-DNRF52840_XXAA {build.flags.usb} {build.flags.power_supply_grove} {build.flags.lbm_custom} -DSEGGER_RTT_MAX_NUM_UP_BUFFERS=2 -DSEGGER_RTT_MAX_NUM_DOWN_BUFFERS=2 -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_NO_BLOCK_SKIP -DBUFFER_SIZE_UP=2048 -DBUFFER_SIZE_DOWN=4 -DNRFX_NVMC_ENABLED=1 -DNRFX_RNG_ENABLED=1 -DNRFX_RTC_ENABLED=1 -DNRFX_RTC2_ENABLED=1 -DNRFX_RTC_DEFAULT_CONFIG_IRQ_PRIORITY=6 -DNRFX_TIMER_ENABLED=1 -DNRFX_TIMER2_ENABLED=1 -DNRFX_WDT_ENABLED=1 -DNRFX_WDT0_ENABLED=1 -DLR11XX -DLR11XX_TRANSCEIVER -DUSE_LR11XX_CE -DENABLE_MODEM_GNSS_FEATURE -DRP2_103 -DREGION_AS_923 -DREGION_AU_915 -DREGION_CN_470 -DREGION_CN_470_RP_1_0 -DREGION_EU_868 -DREGION_IN_865 -DREGION_KR_920 -DREGION_RU_864 -DREGION_US_915 -DREGION_WW2G4 -DWW2G4_SINGLE_DATARATE -DSMTC_MULTICAST -DADD_SMTC_STREAM -DADD_SMTC_FILE_UPLOAD -DADD_SMTC_ALC_SYNC -DMODEM_HAL_DBG_TRACE=1 -DMODEM_HAL_DEEP_DBG_TRACE=0 -DMODEM_HAL_DBG_TRACE_RP=0 -DMODEM_HAL_DBG_TRACE_COLOR=0 -DTASK_EXTENDED_1 -DTASK_EXTENDED_2 -DLR11XX_DISABLE_WARNINGS -DMW_DBG_TRACE=1 -DMW_DBG_TRACE_COLOR=0 -DWM1110_TRACE_MAX_LENGTH=256
wio_tracker_1110.build.ldscript=nrf52840_s140_v6.ld
wio_tracker_1110.build.vid=0x2886
wio_tracker_1110.build.pid=0x8055

# SoftDevice Menu
wio_tracker_1110.menu.softdevice.s140v6=S140 6.1.1
wio_tracker_1110.menu.softdevice.s140v6.build.sd_name=s140
wio_tracker_1110.menu.softdevice.s140v6.build.sd_version=6.1.1
wio_tracker_1110.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Print Port Menu
wio_tracker_1110.menu.debug_output.serial=Serial (USB-CDC)
wio_tracker_1110.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
wio_tracker_1110.menu.debug_output.serial1=Serial1 (UART)
wio_tracker_1110.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1
wio_tracker_1110.menu.debug_output.rtt=Segger RTT
wio_tracker_1110.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2
wio_tracker_1110.menu.debug_output.none=None
wio_tracker_1110.menu.debug_output.none.build.logger_flags=-DCFG_LOGGER=3

# Serial (USB-CDC)
wio_tracker_1110.menu.usb_cdc.enable=Enable
wio_tracker_1110.menu.usb_cdc.disable=Disable
wio_tracker_1110.menu.usb_cdc.disable.build.flags.usb=

# Grove power supply
wio_tracker_1110.menu.power_supply_grove.on=On
wio_tracker_1110.menu.power_supply_grove.on.build.flags.power_supply_grove=-DPOWER_SUPPLY_GROVE=1
wio_tracker_1110.menu.power_supply_grove.off=Off
wio_tracker_1110.menu.power_supply_grove.off.build.flags.power_supply_grove=-DPOWER_SUPPLY_GROVE=0

# Customize LoRaWAN modem
wio_tracker_1110.menu.lbm_custom.standard=No
wio_tracker_1110.menu.lbm_custom.standard.build.flags.lbm_custom=-DLBM_CUSTOM=0
wio_tracker_1110.menu.lbm_custom.sensecap=SenseCAP
wio_tracker_1110.menu.lbm_custom.sensecap.build.flags.lbm_custom=-DLBM_CUSTOM=1

# -----------------------------------
# Adafruit ItsyBitsy nRF52840 Express
# -----------------------------------

itsybitsy52840.build.mcu=cortex-m4
itsybitsy52840.build.f_cpu=64000000
itsybitsy52840.build.board=NRF52840_ITSYBITSY -DARDUINO_NRF52_ITSYBITSY
itsybitsy52840.build.core=nRF5
itsybitsy52840.build.variant=itsybitsy_nrf52840_express
itsybitsy52840.build.usb_manufacturer="Adafruit"
itsybitsy52840.build.usb_product="ItsyBitsy nRF52840 Express"
itsybitsy52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
itsybitsy52840.build.ldscript=nrf52840_s140_v6.ld
itsybitsy52840.build.openocdscript=scripts/openocd/daplink_nrf52.cfg
itsybitsy52840.build.vid=0x239A
itsybitsy52840.build.pid=0x8051
itsybitsy52840.build.uf2_family=0xADA52840

# Menu: SoftDevice
itsybitsy52840.menu.softdevice.s140v6=S140 6.1.1
itsybitsy52840.menu.softdevice.s140v6.build.sd_name=s140
itsybitsy52840.menu.softdevice.s140v6.build.sd_version=6.1.1
itsybitsy52840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Menu: Debug Level
itsybitsy52840.menu.debug.l0=Level 0 (Release)
itsybitsy52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
itsybitsy52840.menu.debug.l1=Level 1 (Error Message)
itsybitsy52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
itsybitsy52840.menu.debug.l2=Level 2 (Full Debug)
itsybitsy52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
itsybitsy52840.menu.debug.l3=Level 3 (Segger SystemView)
itsybitsy52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
itsybitsy52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Menu: Debug Port
itsybitsy52840.menu.debug_output.serial=Serial
itsybitsy52840.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
itsybitsy52840.menu.debug_output.serial1=Serial1
itsybitsy52840.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
itsybitsy52840.menu.debug_output.rtt=Segger RTT
itsybitsy52840.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL

# ----------------------------------
# Seeed XIAO nRF52840 Plus
# ----------------------------------

xiaonRF52840Plus.name=Seeed XIAO nRF52840 Plus

# VID/PID for bootloader
xiaonRF52840Plus.vid.0=0x2886
xiaonRF52840Plus.pid.0=0x8064
xiaonRF52840Plus.vid.1=0x2886
xiaonRF52840Plus.pid.1=0x0064
xiaonRF52840Plus.vid.2=0x2886
xiaonRF52840Plus.pid.2=0x0064
xiaonRF52840Plus.vid.3=0x2886
xiaonRF52840Plus.pid.3=0x8064

# Upload
xiaonRF52840Plus.bootloader.tool=bootburn
xiaonRF52840Plus.upload.tool=nrfutil
xiaonRF52840Plus.upload.protocol=nrfutil
xiaonRF52840Plus.upload.use_1200bps_touch=true
xiaonRF52840Plus.upload.wait_for_upload_port=true
xiaonRF52840Plus.upload.maximum_size=811008
xiaonRF52840Plus.upload.maximum_data_size=237568

# Build
xiaonRF52840Plus.build.mcu=cortex-m4
xiaonRF52840Plus.build.f_cpu=64000000
xiaonRF52840Plus.build.board=Seeed_XIAO_nRF52840_Plus
xiaonRF52840Plus.build.core=nRF5
xiaonRF52840Plus.build.variant=Seeed_XIAO_nRF52840_Plus
xiaonRF52840Plus.build.usb_manufacturer="Seeed"
xiaonRF52840Plus.build.usb_product="XIAO nRF52840 Plus"
xiaonRF52840Plus.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
xiaonRF52840Plus.build.ldscript=nrf52840_s140_v7.ld
xiaonRF52840Plus.build.vid=0x2886
xiaonRF52840Plus.build.pid=0x8064

# SofDevice Menu
xiaonRF52840Plus.menu.softdevice.s140v6=S140 7.3.0
xiaonRF52840Plus.menu.softdevice.s140v6.build.sd_name=s140
xiaonRF52840Plus.menu.softdevice.s140v6.build.sd_version=7.3.0
xiaonRF52840Plus.menu.softdevice.s140v6.build.sd_fwid=0x0123

