vabt-igd/Adafruit_nRF52_Arduino/boards.txt
# Debug Menu
xiaonRF52840Plus.menu.debug.l0=Level 0 (Release)
xiaonRF52840Plus.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
xiaonRF52840Plus.menu.debug.l1=Level 1 (Error Message)
xiaonRF52840Plus.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
xiaonRF52840Plus.menu.debug.l2=Level 2 (Full Debug)
xiaonRF52840Plus.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
xiaonRF52840Plus.menu.debug.l3=Level 3 (Segger SystemView)
xiaonRF52840Plus.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
xiaonRF52840Plus.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# Seeed XIAO nRF52840 Sense Plus
# ----------------------------------

xiaonRF52840SensePlus.name=Seeed XIAO nRF52840 Sense Plus

# VID/PID for bootloader
xiaonRF52840SensePlus.vid.0=0x2886
xiaonRF52840SensePlus.pid.0=0x8065
xiaonRF52840SensePlus.vid.1=0x2886
xiaonRF52840SensePlus.pid.1=0x0065
xiaonRF52840SensePlus.vid.2=0x2886
xiaonRF52840SensePlus.pid.2=0x0065
xiaonRF52840SensePlus.vid.3=0x2886
xiaonRF52840SensePlus.pid.3=0x8065

# Upload
xiaonRF52840SensePlus.bootloader.tool=bootburn
xiaonRF52840SensePlus.upload.tool=nrfutil
xiaonRF52840SensePlus.upload.protocol=nrfutil
xiaonRF52840SensePlus.upload.use_1200bps_touch=true
xiaonRF52840SensePlus.upload.wait_for_upload_port=true
xiaonRF52840SensePlus.upload.maximum_size=811008
xiaonRF52840SensePlus.upload.maximum_data_size=237568

# Build
xiaonRF52840SensePlus.build.mcu=cortex-m4
xiaonRF52840SensePlus.build.f_cpu=64000000
xiaonRF52840SensePlus.build.board=Seeed_XIAO_nRF52840_Sense_Plus
xiaonRF52840SensePlus.build.core=nRF5
xiaonRF52840SensePlus.build.variant=Seeed_XIAO_nRF52840_Sense_Plus
xiaonRF52840SensePlus.build.usb_manufacturer="Seeed"
xiaonRF52840SensePlus.build.usb_product="XIAO nRF52840 Sense Plus"
xiaonRF52840SensePlus.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
xiaonRF52840SensePlus.build.ldscript=nrf52840_s140_v7.ld
xiaonRF52840SensePlus.build.vid=0x2886
xiaonRF52840SensePlus.build.pid=0x8065

# SofDevice Menu
xiaonRF52840SensePlus.menu.softdevice.s140v6=S140 7.3.0
xiaonRF52840SensePlus.menu.softdevice.s140v6.build.sd_name=s140
xiaonRF52840SensePlus.menu.softdevice.s140v6.build.sd_version=7.3.0
xiaonRF52840SensePlus.menu.softdevice.s140v6.build.sd_fwid=0x0123

# Debug Menu
xiaonRF52840SensePlus.menu.debug.l0=Level 0 (Release)
xiaonRF52840SensePlus.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
xiaonRF52840SensePlus.menu.debug.l1=Level 1 (Error Message)
xiaonRF52840SensePlus.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
xiaonRF52840SensePlus.menu.debug.l2=Level 2 (Full Debug)
xiaonRF52840SensePlus.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
xiaonRF52840SensePlus.menu.debug.l3=Level 3 (Segger SystemView)
xiaonRF52840SensePlus.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
xiaonRF52840SensePlus.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# -----------------------------------
# Adafruit Circuit Playground Bluefruit
# -----------------------------------

cplaynrf52840.build.mcu=cortex-m4
cplaynrf52840.build.f_cpu=64000000
cplaynrf52840.build.board=NRF52840_CIRCUITPLAY
cplaynrf52840.build.core=nRF5
cplaynrf52840.build.variant=circuitplayground_nrf52840
cplaynrf52840.build.usb_manufacturer="Adafruit"
cplaynrf52840.build.usb_product="Circuit Playground Bluefruit"
cplaynrf52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
cplaynrf52840.build.ldscript=nrf52840_s140_v6.ld
cplaynrf52840.build.openocdscript=scripts/openocd/daplink_nrf52.cfg
cplaynrf52840.build.vid=0x239A
cplaynrf52840.build.pid=0x8045
cplaynrf52840.build.uf2_family=0xADA52840

# Menu: SoftDevice
cplaynrf52840.menu.softdevice.s140v6=S140 6.1.1
cplaynrf52840.menu.softdevice.s140v6.build.sd_name=s140
cplaynrf52840.menu.softdevice.s140v6.build.sd_version=6.1.1
cplaynrf52840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Menu: Debug Level
cplaynrf52840.menu.debug.l0=Level 0 (Release)
cplaynrf52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
cplaynrf52840.menu.debug.l1=Level 1 (Error Message)
cplaynrf52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
cplaynrf52840.menu.debug.l2=Level 2 (Full Debug)
cplaynrf52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
cplaynrf52840.menu.debug.l3=Level 3 (Segger SystemView)
cplaynrf52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
cplaynrf52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Menu: Debug Port
cplaynrf52840.menu.debug_output.serial=Serial
cplaynrf52840.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
cplaynrf52840.menu.debug_output.serial1=Serial1
cplaynrf52840.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
cplaynrf52840.menu.debug_output.rtt=Segger RTT
cplaynrf52840.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL

# -----------------------------------
# Adafruit CLUE nRF52840
# -----------------------------------

cluenrf52840.build.mcu=cortex-m4
cluenrf52840.build.f_cpu=64000000
cluenrf52840.build.board=NRF52840_CLUE
cluenrf52840.build.core=nRF5
cluenrf52840.build.variant=clue_nrf52840
cluenrf52840.build.usb_manufacturer="Adafruit"
cluenrf52840.build.usb_product="CLUE"
cluenrf52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
cluenrf52840.build.ldscript=nrf52840_s140_v6.ld
cluenrf52840.build.openocdscript=scripts/openocd/daplink_nrf52.cfg
cluenrf52840.build.vid=0x239A
cluenrf52840.build.pid=0x8071
cluenrf52840.build.uf2_family=0xADA52840

# Menu: SoftDevice
cluenrf52840.menu.softdevice.s140v6=S140 6.1.1
cluenrf52840.menu.softdevice.s140v6.build.sd_name=s140
cluenrf52840.menu.softdevice.s140v6.build.sd_version=6.1.1
cluenrf52840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Menu: Debug Level
cluenrf52840.menu.debug.l0=Level 0 (Release)
cluenrf52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
cluenrf52840.menu.debug.l1=Level 1 (Error Message)
cluenrf52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
cluenrf52840.menu.debug.l2=Level 2 (Full Debug)
cluenrf52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
cluenrf52840.menu.debug.l3=Level 3 (Segger SystemView)
cluenrf52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
cluenrf52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Menu: Debug Port
cluenrf52840.menu.debug_output.serial=Serial
cluenrf52840.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
cluenrf52840.menu.debug_output.serial1=Serial1
cluenrf52840.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
cluenrf52840.menu.debug_output.rtt=Segger RTT
cluenrf52840.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL

# -----------------------------------
# Adafruit LED Glasses Driver nRF52840
# -----------------------------------

